Tekla Open API Reference for Tekla Structures 2025
OBB.SetAxis Method (Vector[])
 Sets the Axis to the OBB.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SetAxis(
	Vector[] axis
)
Public Sub SetAxis (
	axis As Vector()
)
Parameters
axis
Type: Tekla.Structures.Geometry3d.Vector[]
Three element array of unit-length vectors parallel the axis of the OBB.
Exceptions
Exception | Condition
ArgumentException | Thrown when setting the axis fails.
See Also
Reference
OBB Class
SetAxis Overload
Tekla.Structures.Geometry3d Namespace